package krt.wid.nohttp.bean;

/**
 * @author Marcus
 * @package krt.wid.nohttp
 * @description
 * @time 2018/2/1
 */

public class Marcus {
    /**
     * id : 9
     * inserter : 1
     * insertTime : 2018-03-07 11:32:10
     * updater : 1
     * updateTime : 2020-06-01 11:03:22
     * info : <p>
     * 1.赣州智慧旅游服务条款的确认<br />
     * 赣州智慧旅游（以下简称“智慧旅游”）各项服务的所有权规由赣州市文化广电新闻出版旅游局所有，运营权规由科睿特软件集团股份有限公司所有。本服务条款具有法律约束力。一旦您点选“注册”，即表示您自愿接受本协议之所有条款，并已成为智慧旅游的注册会员。<br />
     * 2．服务内容<br />
     * 2.1 　智慧旅游的具体内容由赣州智慧旅游建设运营中心提供，<span>赣州市文化广电新闻出版旅游局</span>对其所提供之服务拥有最终解释权。<br />
     * 2.2 <span>科睿特软件集团股份</span>有限公司（智慧旅游建设运营中心）向智慧旅游会员提供相关网络服务。其它与相关网络服务有关的设备（如个人电脑、手机、及其他与接入互联网或移动网有关的装置）及所需的费用（如为接入互联网而支付的电话费及上网费、为使用移动网而支付的手机费等）均由会员自行负担。<br />
     * 3．会员账号及密码<br />
     * 您一旦注册成功成为用户，您将得到一个账号和密码。如果您不保管好自己的账号和密码安全，因此产生的所有损失将由您全部承担并负相应责任。此外，每个用户都要对其账户中的所有活动和事件负全责。您可随时更改您的密码，也可以重开一个新的账户。用户若发现任何非法使用用户账号或安全漏洞的情况，请立即通告赣州智慧旅游。<br />
     * 4．会员权责<br />
     * 4.1 　会员有权按照智慧旅游规定的程序和要求使用智慧旅游向会员提供的各项网络服务，如果会员对该服务有异议，可以与智慧旅游联系以便得到及时解决。<br />
     * 4.2 　用户在申请使用智慧旅游服务时，必须向智慧旅游提供准确的个人资料，如个人资料有任何变动，必须及时更新。<br />
     * 4.3 　会员在智慧旅游的APP上发布信息或者利用智慧旅游的服务时必须符合国家的法律及相关规定。<br />
     * 4.4 智慧旅游建设运营中心作为网络服务提供者，对非法转载、使用行为的发生不具备充分的监控能力。但当版权拥有者提出侵权指控并提供充分的版权证明材料时，智慧旅游将移除非法使用、转载的作品及停止继续传播。智慧旅游对他人在网站上实施的此类侵权行为不承担法律责任，侵权的法律责任由会员本人承担。
     * </p>
     * <p>
     * 4.5 　会员承诺不会在智慧旅游的消息平台（包括但不限于网站、微信公众号等）发布如下信息：<br />
     * (1) 反对宪法所确定的基本原则的；
     * </p>
     * <p>
     * <span>(2) </span>危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
     * </p>
     * <p>
     * (3) 损害国家荣誉和利益的；<br />
     * (4) 煽动民族仇恨、民族歧视，破坏民族团结的；<br />
     * (5) 破坏国家宗教政策，宣扬邪教和封建迷信的；<br />
     * (6) 散布谣言，扰乱社会秩序，破坏社会稳定的；<br />
     * (7) 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；<br />
     * (8) 侮辱或者诽谤他人，侵害他人合法权益的；<br />
     * (9) 含有法律、行政法规禁止的其他内容的。<br />
     * 4.6 　会员单独为其发布在智慧旅游平台上的信息承担责任。会员若在平台上散布和传播违法信息，网络会员服务的系统记录有可能作为会员违法之证据。<br />
     * 4.7 　会员不得利用本站的服务从事以下活动：<br />
     * (1) 未经允许，进入计算机信息网络或者使用计算机信息网络资源；<br />
     * (2) 未经允许，对计算机信息网络功能进行删除、修改或者增加；<br />
     * (3) 未经允许，对进入计算机信息网络中存储、处理或者传输的数据和应用程序进行删除、修改或者增加；<br />
     * (4) 故意制作、传播计算机病毒等破坏性程序；<br />
     * (5) 其他危害计算机信息网络安全的行为。<br />
     * 4.8 　会员不得以任何方式干扰本站的服务。<br />
     * 4.9 　会员承诺遵守本站的所有其他规定和程序。<br />
     * 4.10 　如果会员违反上述规定，智慧旅游有权要求其改正或直接采取一切必要措施（包括但不限于更改或删除会员发布的信息、中断或终止会员使用网络的权利等），以减轻会员不当行为所造成的影响。<br />
     * 5．服务条款的修改<br />
     * 智慧旅游有权在必要时修改本服务条款，服务条款的内容一旦发生变动，智慧旅游将会通过适当方式向会员提示修改内容。会员如不同意修改，可以主动选择取消会员资格；如果会员继续使用智慧旅游平台服务，将被视为接受修改后的服务条款。
     * </p>
     * <p>
     * 6．服务内容的修改或中断<br />
     * 鉴于网络服务的特殊性，智慧旅游平台保留随时修改或中断其部分或全部网络服务的权利，并无需通知会员或为此对会员及任何第三方负责。<br />
     * 7．会员隐私保护<br />
     * 智慧旅游尊重会员的隐私权，不会公开、编辑或泄露任何有关会员的个人资料以及会员在使用网络服务时存储在智慧旅游的非公开内容，但以下情况除外：<br />
     * （1）事先获得会员的明确授权；<br />
     * （2）遵守法律规定或智慧旅游合法服务程序；<br />
     * （3）按照相关政府主管部门的合理要求；<br />
     * （4）维护社会公众利益；<br />
     * （5）维护智慧旅游的合法权益；<br />
     * （6）符合其他合法要求。<br />
     * 8．中断或终止服务<br />
     * 如发生下列任何一种情形，智慧旅游有权随时中断或终止向会员提供本协议项下的网络服务，而无需对会员或任何第三方承担任何责任。<br />
     * （1）会员向智慧旅游提供的个人资料不真实。<br />
     * （2）会员违反本协议的规则或不履行其所承担的义务。<br />
     * 除此之外，会员可随时根据需要通知智慧旅游终止向该会员提供服务，会员服务终止后，会员使用服务的权利同时终止。自会员服务终止之时起，智慧旅游不再对该会员承担任何责任。<br />
     * <br />
     * 9．免责声明<br />
     * 9.1 智慧旅游对任何因会员不正当或非法使用服务、在网上进行交易、或会员传送信息变动而产生的直接、间接、偶然、特殊及后续的损害不承担责任。<br />
     * 9.2 智慧旅游对任何他人的威胁性的、诽谤性的、淫秽的、令人反感的或非法的内容或行为或对他人权利的侵犯（包括知识产权）不承担责任；并对任何第三方通过服务发送或在服务中包含的任何内容不承担责任。<br />
     * 9.3 会员明确同意其使用智慧旅游服务所存在的风险以及使用智慧旅游APP服务产生的一切后果由其自己承担。<br />
     * 9.4 对于因不可抗力或智慧旅游平台不能控制的原因造成的网络服务中断或其它缺陷，平台不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。
     * </p>
     * <p>
     * 9.5  智慧旅游线下体验团，不可抗力因素（天气原因或政策导向等原因）造成的不能发团或退款，平台不承担额外的退款赔偿。<br />
     * 9.6 智慧旅游平台不对所提供之网络服务做任何类型之担保，包括但不限于：<br />
     * （1） 网络服务一定能满足会员要求；<br />
     * （2） 网络服务不会中断；<br />
     * （3） 网络服务的及时性、安全性、准确性。
     * </p>
     * <p>
     * <br />
     * </p>
     * tag : krt007
     * type : 1
     * state : 1
     */

    private int id;
    private int inserter;
    private String insertTime;
    private int updater;
    private String updateTime;
    private String info;
    private String tag;
    private int type;
    private int state;

    public int getId() {
        return id;
    }

    public void setId(int id) {
        this.id = id;
    }

    public int getInserter() {
        return inserter;
    }

    public void setInserter(int inserter) {
        this.inserter = inserter;
    }

    public String getInsertTime() {
        return insertTime;
    }

    public void setInsertTime(String insertTime) {
        this.insertTime = insertTime;
    }

    public int getUpdater() {
        return updater;
    }

    public void setUpdater(int updater) {
        this.updater = updater;
    }

    public String getUpdateTime() {
        return updateTime;
    }

    public void setUpdateTime(String updateTime) {
        this.updateTime = updateTime;
    }

    public String getInfo() {
        return info;
    }

    public void setInfo(String info) {
        this.info = info;
    }

    public String getTag() {
        return tag;
    }

    public void setTag(String tag) {
        this.tag = tag;
    }

    public int getType() {
        return type;
    }

    public void setType(int type) {
        this.type = type;
    }

    public int getState() {
        return state;
    }

    public void setState(int state) {
        this.state = state;
    }
}
